---
kind: property
id: P:Autodesk.Revit.DB.ElementType.CanBeRenamed
source: html/ce2e0f26-deaf-d649-0617-babde54c6bf7.htm
---
# Autodesk.Revit.DB.ElementType.CanBeRenamed Property

Determine if this ElementType can be renamed

## Syntax (C#)
```csharp
public bool CanBeRenamed { get; }
```